[
      {
      "otherFormats": [
        "library Binding",
        "Audio CD",
        "Mass Market Paperbak"
      ],
      "bookTitle":"Then She was Gone: A Novel",
      "author":"Lisa Jewell",
      "releaseDate":"Nov 6, 2018",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":12.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Library Binding",
           "price":66.00
         },
         {
           "format":"Paperback",
           "price":8.79
         }
        ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/5174PRC0BDL._SX320_BO1,204,203,200_.jpg",
      "description": "Ellie Mack was the perfect daughter. She was fifteen, the youngest of three. Beloved by her parents, friends, and teachers, and half of a teenaged golden couple. Ellie was days away from an idyllic post-exams summer vacation, with her whole life ahead of her.And then she was gone.Now, her mother Laurel Mack is trying to put her life back together. It’s been ten years since her daughter disappeared, seven years since her marriage ended, and only months since the last clue in Ellie’s case was unearthed. So when she meets an unexpectedly charming man in a café, no one is more surprised than Laurel at how quickly their flirtation develops into something deeper. Before she knows it, she’s meeting Floyd’s daughters—and his youngest, Poppy, takes Laurel’s breath away.Because looking at Poppy is like looking at Ellie. And now, the unanswered questions she’s tried so hard to put to rest begin to haunt Laurel anew. Where did Ellie go? Did she really run away from home, as the police have long suspected, or was there a more sinister reason for her disappearance? Who is Floyd, really? And why does his daughter remind Laurel so viscerally of her own missing girl?"
    },
    {
      "bookTitle":"Wonder",
      "author":"Lisa Jewell",
      "releaseDate":"Feb 14, 2012",
      "bookFormat": [
         {
           "format":"Kindle",
           "price":9.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Hardcover",
           "price":9.29
         },
         {
           "format":"Paperback",
           "price":11.15
         }
        ],
      "otherFormats": [
        "Paperback",
        "MP3 CD"
      ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/41rBFbAYOeL._SX337_BO1,204,203,200_.jpg",
      "description":"August Pullman was born with a facial difference that, up until now, has prevented him from going to a mainstream school. Starting 5th grade at Beecher Prep, he wants nothing more than to be treated as an ordinary kid—but his new classmates can’t get past Auggie’s extraordinary face. WONDER, now a #1 New York Times bestseller and included on the Texas Bluebonnet Award master list, begins from Auggie’s point of view, but soon switches to include his classmates, his sister, her boyfriend, and others. These perspectives converge in a portrait of one community’s struggle with empathy, compassion, and acceptance."
    },
    {
      "bookTitle":"Little Fires Everywhere: A novel",
      "author":"Celeste Ng",
      "releaseDate":"May 7, 2019",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":9.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Hardcover",
           "price":11.41
         },
         {
           "format":"Paperback",
           "price":9.18
         }
        ],
     
      "otherFormats": [
        "Hardcover",
         "Mass Market Paperback",
        "Audio CD"
      ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/512C6iRaT+L._SX331_BO1,204,203,200_.jpg",
      "description":"Enter Mia Warren—an enigmatic artist and single mother—who arrives in this idyllic bubble with her teenaged daughter Pearl, and rents a house from the Richardsons. Soon Mia and Pearl become more than tenants: all four Richardson children are drawn to the mother-daughter pair. But Mia carries with her a mysterious past and a disregard for the status quo that threatens to upend this carefully ordered community."
    },
    {
      "bookTitle":"The Woman I was before:A gripping emotional page turner with atwist",
      "author":"Kerry Fisher",
      "releaseDate":"May 22, 2019",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":3.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Paperback",
           "price":5.31
         },
         {
           "format":"MP3 CD",
           "price":14.99
         }
        ],
     
      "otherFormats": [
        
        "MP3 CD"
      ],
      "imageUrl":"https://m.media-amazon.com/images/I/6131E73CYzL._AC_UY436_FMwebp_QL65_.jpg",
      "description":"Kate isn’t the only woman on the street starting afresh. Warm, whirlwind Gisela with her busy life and confident children, and sharp, composed Sally, with her spontaneous marriage and high-flying career, are the first new friends Kate has allowed herself in years. While she can’t help but envy their seemingly perfect lives, their friendship might help her leave her guilt behind.Until one day, everything changes. Kate is called to the scene of a devastating car accident, the consequences of which will test everything the women thought they knew about each other, and themselves. ‘It’s been a long time since I read a whole book in 24 hours but there was no way I was putting down The Woman I Was Before. No one writes complex, painful family love like Kerry Fisher. Real and raw but funny too. Loved it!’ Iona Grey, author of Letters to the Lost"
    },
    {
      "bookTitle":"Thirteen Reasons Why",
      "author":"Jay Asher",
      "releaseDate":"Jun 14, 2011",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":9.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Hardcover",
           "price":11.50
         },
         {
           "format":"Paperback",
           "price":7.12
         }
        ],
     
      "otherFormats": [
        "Hardcover",
        "Mass Market Paperback",
        "Audio CD"
      ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/5112kQJt31L._SX331_BO1,204,203,200_.jpg",
      "description":"Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker—his classmate and crush—who committed suicide two weeks earlier. Hannah's voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find out why. Clay spends the night crisscrossing his town with Hannah as his guide. He becomes a firsthand witness to Hannah's pain, and as he follows Hannah’s recorded words throughout his town, what he discovers changes his life forever"
    },
    {
      "bookTitle":"The Silent Wife:A gripping, emotional page-turner with a twist that will take your breath away ",
      "author":"Kerry Fisher",
      "releaseDate":"Nov 13, 2018",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":3.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Paperback",
           "price":5.73
         },
         {
           "format":"Mass Market Paperback",
           "price":2.99
         }
        ],
     
      "otherFormats": [
        "Hardcover",
        "Mass Market Paperback",
        "MP3 CD"
      ],
      "imageUrl":"https://m.media-amazon.com/images/I/51RJOx38qKL._AC_UY436_FMwebp_QL65_.jpg",
      "description":"Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker—his classmate and crush—who committed suicide two weeks earlier. Hannah's voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find out why. Clay spends the night crisscrossing his town with Hannah as his guide. He becomes a firsthand witness to Hannah's pain, and as he follows Hannah’s recorded words throughout his town, what he discovers changes his life forever"
    },
    {
      "bookTitle":"Sold on a Monday: A Novel",
      "author":"Kerry Fisher",
      "releaseDate":"March 27, 2020",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":7.59
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Libray Binding",
           "price":33.99
         },
         {
           "format":"Paperback",
           "price":9.59
         }
        ],
     
      "otherFormats": [
        "Hardcover",
        "Mass Market Paperback",
        "MP3 CD"
      ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/41oSSR2M7iL._SX331_BO1,204,203,200_.jpg",
      "description":"For struggling reporter Ellis Reed, the gut-wrenching scene evokes memories of his family's dark past. He snaps a photograph of the children, not meant for publication. But when it leads to his big break, the consequences are more devastating than he ever imagined. Kristina McMorris's poignant historical novel will capture fans of Before We Were Yours by Lisa Wingate and The Lilac Girls by Martha Hall Kelly and inspire any book club"
    }
    ,
    {
      "bookTitle":"The Hideaway",
      "author":"Lauren K. Denton",
      "releaseDate":"Aprial 11, 2017",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":9.02
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Libray Binding",
           "price":30.99
         },
         {
           "format":"Paperback",
           "price":9.02
         },
          {
           "format":"MP3 CD",
           "price":9.99
         }
        ],
     
      "otherFormats": [
        "Hardcover",
        "Mass Market Paperback",
        "MP3 CD"
      ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51tHW6Qb+IL._SX326_BO1,204,203,200_.jpg",
      "description":"After her last remaining family member dies, Sara Jenkins goes home to The Hideaway, her grandmother Mags’s ramshackle B&B in Sweet Bay. She intends to quickly tie up loose ends then return to her busy life and thriving antique shop in New Orleans. Instead, she learns Mags has willed The Hideaway to her and charged her with renovating it—no small task considering her grandmother’s best friends, a motley crew of senior citizens, still live there. Rather than hurrying back to New Orleans, Sara stays in Sweet Bay and begins the biggest house-rehabbing project of her career. Amid drywall dust, old memories, and a charming contractor, she discovers that slipping back into life at The Hideaway is easier than she expected"
    }
    
    ,
    {
      "bookTitle":"  We Were the Lucky Ones: A Novel",
      "author":"Georgia Hunter",
      "releaseDate":"Jan 2, 2018",
       "bookFormat": [
         {
           "format":"Kindle",
           "price":8.99
         },
         {
           "format":"Audio Book",
           "price":0.0
         },
         {
           "format":"Hardcover",
           "price":18.94
         },
         {
           "format":"Paperback",
           "price":6.23
         }
        ],
     
      "otherFormats": [
        "Hardcover",
        "Mass Market Paperback",
        "MP3 CD"
      ],
      "imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51xZ-WmjlqL._SX331_BO1,204,203,200_.jpg",
      "description":"It is the spring of 1939 and three generations of the Kurc family are doing their best to live normal lives, even as the shadow of war grows closer. The talk around the family Seder table is of new babies and budding romance, not of the increasing hardships threatening Jews in their hometown of Radom, Poland. But soon the horrors overtaking Europe will become inescapable and the Kurcs will be flung to the far corners of the world, each desperately trying to navigate his or her own path to safety. As one sibling is forced into exile, another attempts to flee the continent, while others struggle to escape certain death, either by working grueling hours on empty stomachs in the factories of the ghetto or by hiding as gentiles in plain sight. Driven by an unwavering will to survive and by the fear that they may never see one another again, the Kurcs must rely on hope, ingenuity, and inner strength to persevere."
    }
    
  

]

